Revit 2027 API
WorksetConfiguration(WorksetConfigurationOption) Constructor
 Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetConfiguration(
	WorksetConfigurationOption option
)
Public Sub New (
	option As WorksetConfigurationOption
)
public:
WorksetConfiguration(
	WorksetConfigurationOption option
)
new :
        option : WorksetConfigurationOption -> WorksetConfiguration
Parameters
option WorksetConfigurationOption
 The option to open or close all user created worksets by default.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace